function getChromosomes(ARG)
% Вибирає ARG хромосом, що є дійсними шляхами у матриці інцидентностей (ненульовими)
%   та обчислює їх функції фітнесу для глобальної матриці інцидентностей IM
% ARG  - кількість хромосом для вибору
% Результат: набір хромосом у глобальній змінній CH
%            набір значень фітнесу у глобальній змінній CHF

global IM;
global CH;
global CHF;
% отримуємо кількість міст
[n,n]=size(IM);
% створюємо масив для збереження хромосом
CH=zeros(ARG,n);
% створюємо масив для збереження значень фітнесу хромосом
CHF=zeros(ARG,1);

% проходимо по кожній хромосомі та будуємо її
for i=1:ARG
    SZ=n;               % кількість ще не використаних міст
    SZA=1:n;            % номери ще не використаних міст
    cities=0;           % кількість вже вибраних міст для даної хромосоми

    while (cities<n)
        nCity=floor(rand(1)*SZ)+1;      % вибираємо випадкове місто
        if (nCity==n+1) nCity=n; end    % коригуємо результат
        % записуємо місто
        cities=cities+1;
        CH(i,cities)=SZA(nCity);
        SZ=SZ-1;                        % кількість невибраних міст зменшилась
        % вилучаємо вибране місто
        for j=nCity:SZ SZA(j)=SZA(j+1); end
    end
    CHF(i,1)=checkFitness(CH(i,:));
end        