function RES=checkPosition(CH,nPLATE,POINT,PLATE)
% Перевіряє, чи нормально лягла пластинка для вирізання на велику пластину
% Аргументи:
% CH     - хромосома
% nPLATE - номер пластинки, що встановлюється
% POINT  - точка, в яку встановлюється пластина
% PLATE  - параметри великої пластини
% Результат:
% RES    - 0 якщо пластина не стала, 1 - якщо нормально стала

RES=1;
% перевіряємо, чи не виходить пластинка за межі пластини
if (POINT(1,1)+CH(1,(nPLATE-1)*5+4)>PLATE(1,1)) || (POINT(1,2)-CH(1,(nPLATE-1)*5+5)<0)
    RES=0;
end
% перевіряємо, чи не перетинається пластинка з іншими
index=1;
while (RES==1) && (index<nPLATE)
    xS1=CH(1,(index-1)*5+2);
    xS2=CH(1,(index-1)*5+2)+CH(1,(index-1)*5+4);
    yS1=CH(1,(index-1)*5+3);
    yS2=CH(1,(index-1)*5+3)-CH(1,(index-1)*5+5);
    x1=POINT(1,1);
    y1=POINT(1,2);
    x2=POINT(1,1)+CH(1,(nPLATE-1)*5+4);
    y2=POINT(1,2)-CH(1,(nPLATE-1)*5+5);
    if ~(((xS1<=x1) && (xS2<=x1) && (xS1<=x2) && (xS2<=x2)) || ...
         ((xS1>=x1) && (xS2>=x1) && (xS1>=x2) && (xS2>=x2)) || ...
         ((yS1>=y1) && (yS2>=y1) && (yS1>=y2) && (yS2>=y2)) || ...
         ((yS1<=y1) && (yS2<=y1) && (yS1<=y2) && (yS2<=y2)))
        RES=0;
    end
    index=index+1;
end