function RES=getResult(ARG)
% ѕеретворенн€ результату у нормальний вигл€д, коли подано в≥дстан≥ м≥ж
% вузлами та в≥дстань усього шл€ху
% јргументи: ARG - список вузл≥в (починаючи ≥з другого елемента)
%            IM  - матриц€ ≥нцидентностей (глобальна зм≥нна)
% –езультат: RES - список в≥дстаней (починаючи з другого елемента) та загальна в≥дстань

RES=ARG;
global IM;
[m,n]=size(ARG);
SUM=0;
for i=2:n-1
    RES(1,i)=IM(ARG(1,i),ARG(1,i+1));
    SUM=SUM+RES(1,i);
end
RES(1,n)=IM(ARG(1,n),ARG(1,2));
SUM=SUM+RES(1,n);
RES(1,1)=SUM;